app/controllers/grams_controller.rb

  def index
    @grams = Gram.all
---
SELECT "grams".* FROM "grams"

  def create
    @gram = current_user.grams.create(gram_params)
---
INSERT INTO "grams" ("message", "created_at", "updated_at", "user_id", "picture") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["message", "Tasty!"], ["created_at", "2019-07-11 23:07:34.810393"], ["updated_at", "2019-07-11 23:07:34.810393"], ["user_id", 1], ["picture", "icecream.jpg"]]

  def edit
    @gram = Gram.find_by_id(params[:id])
---
SELECT  "grams".* FROM "grams" WHERE "grams"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def update
    @gram = Gram.find_by_id(params[:id])
    return render_not_found if @gram.blank?
    return render_not_found(:forbidden) if @gram.user != current_user
    @gram.update_attributes(gram_params)
---
SELECT  "grams".* FROM "grams" WHERE "grams"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "grams" SET "message" = $1, "updated_at" = $2 WHERE "grams"."id" = $3  [["message", "Tasty! #chocolate"], ["updated_at", "2019-07-11 23:08:27.524273"], ["id", 1]]

  def destroy
    @gram = Gram.find_by_id(params[:id])
    return render_not_found if @gram.blank?
    return render_not_found(:forbidden) if @gram.user != current_user
    @gram.destroy
---
SELECT  "grams".* FROM "grams" WHERE "grams"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
DELETE FROM "grams" WHERE "grams"."id" = $1  [["id", 2]]