app/views/grams/index.html.erb

        <h3>Comments</h3>
        <% gram.comments.each do |comment| %>
---
SELECT "comments".* FROM "comments" WHERE "comments"."gram_id" = $1  [["gram_id", 1]]